In [1]:
import pandas as pd

In [2]:
%store -r lname_df

In [3]:
lname_df.head()

       913465 smith
0    571819 johnson
1      512312 jones
2   503266 williams
3      471390 brown
4        386764 lee

In [9]:
cleaned_lname = lname_df[' 913465 smith'].str.split().str[1].to_frame(name='Words')
cleaned_lname = cleaned_lname.reset_index(drop=True)

In [10]:
cleaned_lname.head()

      Words
0   johnson
1     jones
2  williams
3     brown
4       lee

In [11]:
%store cleaned_lname

Stored 'cleaned_lname' (DataFrame)